In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("CustData.csv")
df

    CustomerID   Gender  Age  Income
0            1    Male    43      41
1            2    Male    32      43
2            3  Female    26      31
3            4  Female    21      43
4            5  Female    22      37
5            6    Male    42      24
6            7    Male    48      14
7            8    Male    34      37
8            9    Male    21      41
9           10  Female    46      37
10          11  Female    36      40
11          12  Female    23      48
12          13    Male    21      25
13          14    Male    18      45
14          15    Male    41      19
15          16    Male    19      20
16          17  Female    40      43
17          18  Female    33      19
18          19  Female    47      15
19          20  Female    35      30
20          21    Male    27      38
21          22    Male    20      30
22          23    Male    38      40
23          24    Male    50      46
24          25  Female    35      46
25          26  Female    18      32
26          27  Female    18      31
27          28    Male    46      13
28          29    Male    23      26
29          30    Male    34      26

In [5]:
df.describe()

       CustomerID        Age     Income
count   30.000000  30.000000  30.000000
mean    15.500000  31.900000  32.666667
std      8.803408  10.551516  10.535108
min      1.000000  18.000000  13.000000
25%      8.250000  21.250000  25.250000
50%     15.500000  33.500000  34.500000
75%     22.750000  40.750000  41.000000
max     30.000000  50.000000  48.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  30 non-null     int64
 1   Gender      30 non-null     object
 2   Age         30 non-null     int64
 3   Income      30 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.1+ KB

In [9]:
df.isna()

    CustomerID  Gender    Age  Income
0        False   False  False   False
1        False   False  False   False
2        False   False  False   False
3        False   False  False   False
4        False   False  False   False
5        False   False  False   False
6        False   False  False   False
7        False   False  False   False
8        False   False  False   False
9        False   False  False   False
10       False   False  False   False
11       False   False  False   False
12       False   False  False   False
13       False   False  False   False
14       False   False  False   False
15       False   False  False   False
16       False   False  False   False
17       False   False  False   False
18       False   False  False   False
19       False   False  False   False
20       False   False  False   False
21       False   False  False   False
22       False   False  False   False
23       False   False  False   False
24       False   False  False   False
25       False   False  False   False
26       False   False  False   False
27       False   False  False   False
28       False   False  False   False
29       False   False  False   False

In [11]:
df.head()

   CustomerID   Gender  Age  Income
0           1    Male    43      41
1           2    Male    32      43
2           3  Female    26      31
3           4  Female    21      43
4           5  Female    22      37

In [13]:
df.tail()

    CustomerID   Gender  Age  Income
25          26  Female    18      32
26          27  Female    18      31
27          28    Male    46      13
28          29    Male    23      26
29          30    Male    34      26

In [15]:
df.dtypes

CustomerID     int64
Gender        object
Age            int64
Income         int64
dtype: object

In [17]:
df.loc[:,"CustomerID"].mean()

15.5

In [19]:
df.loc[:,"CustomerID"].median()

15.5

In [21]:
df.loc[:,"CustomerID"].var()

77.5

In [23]:
df.loc[:,"CustomerID"].std()

8.803408430829505

In [25]:
df.mode()

    CustomerID Gender   Age  Income
0            1  Male   18.0    37.0
1            2    NaN  21.0    43.0
2            3    NaN   NaN     NaN
3            4    NaN   NaN     NaN
4            5    NaN   NaN     NaN
5            6    NaN   NaN     NaN
6            7    NaN   NaN     NaN
7            8    NaN   NaN     NaN
8            9    NaN   NaN     NaN
9           10    NaN   NaN     NaN
10          11    NaN   NaN     NaN
11          12    NaN   NaN     NaN
12          13    NaN   NaN     NaN
13          14    NaN   NaN     NaN
14          15    NaN   NaN     NaN
15          16    NaN   NaN     NaN
16          17    NaN   NaN     NaN
17          18    NaN   NaN     NaN
18          19    NaN   NaN     NaN
19          20    NaN   NaN     NaN
20          21    NaN   NaN     NaN
21          22    NaN   NaN     NaN
22          23    NaN   NaN     NaN
23          24    NaN   NaN     NaN
24          25    NaN   NaN     NaN
25          26    NaN   NaN     NaN
26          27    NaN   NaN     NaN
27          28    NaN   NaN     NaN
28          29    NaN   NaN     NaN
29          30    NaN   NaN     NaN

In [27]:
df.loc[:,"Income"].mean()

32.666666666666664

In [29]:
df.loc[:,"Income"].median()

34.5

In [31]:
df.loc[:,"Income"].std()

10.5351082456293

In [33]:
df.loc[:,"Income"].var()

110.98850574712645

In [35]:
df.min()

CustomerID          1
Gender        Female
Age                18
Income             13
dtype: object

In [37]:
df.max()

CustomerID       30
Gender        Male
Age              50
Income           48
dtype: object

In [39]:
df.groupby(['Gender']).mean()

         CustomerID        Age     Income
Gender
Female    15.153846  30.769231  34.769231
Male      15.764706  32.764706  31.058824

In [41]:
df.groupby(['Gender']).median()

         CustomerID   Age  Income
Gender
Female         17.0  33.0    37.0
Male           15.0  34.0    30.0

In [43]:
df.groupby(['Gender'])['Age'].mean()

Gender
Female     30.769231
Male       32.764706
Name: Age, dtype: float64

In [45]:
df.groupby(['Gender'])['Age'].median()

Gender
Female     33.0
Male       34.0
Name: Age, dtype: float64

In [47]:
df.groupby(['Gender'])['Age'].std()

Gender
Female     10.125495
Male       11.093520
Name: Age, dtype: float64

In [49]:
df.groupby(['Gender'])['Age'].var()

Gender
Female     102.525641
Male       123.066176
Name: Age, dtype: float64

In [51]:
df.groupby(['Gender'])['Age'].max()

Gender
Female     47
Male       50
Name: Age, dtype: int64

In [53]:
df.groupby(['Gender'])['Age'].min()

Gender
Female     18
Male       18
Name: Age, dtype: int64

In [89]:
#Quantile by 0.25,0.50,0.75
df.groupby(['Gender'])['Age'].quantile(0.25)

Gender
Female     22.0
Male       21.0
Name: Age, dtype: float64

In [57]:
df.groupby(['Gender'])['Age'].quantile(0.5)

Gender
Female     33.0
Male       34.0
Name: Age, dtype: float64

In [59]:
df.groupby(['Gender'])['Age'].quantile(0.75)

Gender
Female     36.0
Male       42.0
Name: Age, dtype: float64

In [61]:
df.groupby(['Gender'])['Income'].mean()

Gender
Female     34.769231
Male       31.058824
Name: Income, dtype: float64

In [63]:
df.groupby(['Gender'])['Income'].median()

Gender
Female     37.0
Male       30.0
Name: Income, dtype: float64

In [65]:
df.groupby(['Gender'])['Income'].std()

Gender
Female      9.883942
Male       11.025372
Name: Income, dtype: float64

In [67]:
df.groupby(['Gender'])['Income'].var()

Gender
Female      97.692308
Male       121.558824
Name: Income, dtype: float64

In [69]:
df.groupby(['Gender'])['Income'].max()

Gender
Female     48
Male       46
Name: Income, dtype: int64

In [71]:
df.groupby(['Gender'])['Income'].quantile(0.25)

Gender
Female     31.0
Male       24.0
Name: Income, dtype: float64

In [73]:
df.groupby(['Gender'])['Income'].quantile(0.5)

Gender
Female     37.0
Male       30.0
Name: Income, dtype: float64

In [75]:
df.groupby(['Gender'])['Income'].quantile(0.75)

Gender
Female     43.0
Male       41.0
Name: Income, dtype: float64

In [77]:
df.groupby(['Age'])['Income'].mean()

Age
18    36.000000
19    20.000000
20    30.000000
21    36.333333
22    37.000000
23    37.000000
26    31.000000
27    38.000000
32    43.000000
33    19.000000
34    31.500000
35    38.000000
36    40.000000
38    40.000000
40    43.000000
41    19.000000
42    24.000000
43    41.000000
46    25.000000
47    15.000000
48    14.000000
50    46.000000
Name: Income, dtype: float64

In [79]:
df.groupby(['Age'])['Income'].median()

Age
18    32.0
19    20.0
20    30.0
21    41.0
22    37.0
23    37.0
26    31.0
27    38.0
32    43.0
33    19.0
34    31.5
35    38.0
36    40.0
38    40.0
40    43.0
41    19.0
42    24.0
43    41.0
46    25.0
47    15.0
48    14.0
50    46.0
Name: Income, dtype: float64

In [81]:
df.groupby(['Age'])['Income'].var()

Age
18     61.000000
19           NaN
20           NaN
21     97.333333
22           NaN
23    242.000000
26           NaN
27           NaN
32           NaN
33           NaN
34     60.500000
35    128.000000
36           NaN
38           NaN
40           NaN
41           NaN
42           NaN
43           NaN
46    288.000000
47           NaN
48           NaN
50           NaN
Name: Income, dtype: float64

In [83]:
df.groupby(['Age'])['Income'].std()

Age
18     7.810250
19          NaN
20          NaN
21     9.865766
22          NaN
23    15.556349
26          NaN
27          NaN
32          NaN
33          NaN
34     7.778175
35    11.313708
36          NaN
38          NaN
40          NaN
41          NaN
42          NaN
43          NaN
46    16.970563
47          NaN
48          NaN
50          NaN
Name: Income, dtype: float64

In [85]:
df.groupby(['Age'])['Income'].quantile(0.25)

Age
18    31.50
19    20.00
20    30.00
21    33.00
22    37.00
23    31.50
26    31.00
27    38.00
32    43.00
33    19.00
34    28.75
35    34.00
36    40.00
38    40.00
40    43.00
41    19.00
42    24.00
43    41.00
46    19.00
47    15.00
48    14.00
50    46.00
Name: Income, dtype: float64

In [87]:
df.groupby(['Age'])['Income'].quantile(0.5)

Age
18    32.0
19    20.0
20    30.0
21    41.0
22    37.0
23    37.0
26    31.0
27    38.0
32    43.0
33    19.0
34    31.5
35    38.0
36    40.0
38    40.0
40    43.0
41    19.0
42    24.0
43    41.0
46    25.0
47    15.0
48    14.0
50    46.0
Name: Income, dtype: float64

In [91]:
df.groupby(['Age'])['Income'].quantile(0.75)

Age
18    38.50
19    20.00
20    30.00
21    42.00
22    37.00
23    42.50
26    31.00
27    38.00
32    43.00
33    19.00
34    34.25
35    42.00
36    40.00
38    40.00
40    43.00
41    19.00
42    24.00
43    41.00
46    31.00
47    15.00
48    14.00
50    46.00
Name: Income, dtype: float64